#include <iostream>
using namespace std;

/*
	1.Сформировать одномерный массив целых чисел, используя датчик случайных чисел.
	2.Распечатать полученный массив.
	3.Удалить первый элемент с заданным значением.
	4.Сдвинуть массив циклически на К элементов вправо.
	5.Распечатать полученный массив.
*/
int main9() {
	setlocale(0, "Rus");
	srand(time(NULL));
	int m[100], n = 100, len, a, k;
	for (int i = 0; i < n; i++) { // заполнение массива случайными числами
		m[i] = rand() % 100;
	}
	cout << "Введите длину массива (не больше 100): ";
	cin >> len;

	cout << endl;

	cout << "{ " << " ";
	for (int i = 0; i < len; i++){  // вывод массива	
		cout << m[i] << " ";
	}
	cout << " }" << " ";

	cout << endl;

	cout << endl << "Введите значение, первое вхождение которого в массиве нужно удалить: ";
	cin >> a;
	for (int i = 0; i < len; i++) {    
		if (m[i] == a) {						// если нашли этот элемент - сдвигаем весь массив на 1 элемент влево,
			for (int j = i; j < len - 1; j++) { // тем замым "затирая" заданный элемент
				m[j] = m[j + 1];
			}
		}
	}
	
	cout << endl;

	cout << "{ " << " ";
	for (int i = 0; i < len - 1; i++) {  // вывод массива на 1 элемент меньше, т.к. массив должен был стать на элемент меньше
		cout << m[i] << " ";
	}
	cout << " }" << " ";

	cout << endl;

	int tmp1, tmp2;
	cout << endl << "Введите число k, на которое нужно циклически сдвинуть массив вправо: ";
	cin >> k;
	for (int i = 0; i < k; i++) {  // каждая итерация будет сдвигать на один элемент вправо
		tmp1 = m[0];			// присваиваем tmp1 значение нулевого элемента
		m[0] = m[(len - 1) - 1]; // на его место ставим значение последнего элемента
		for (int j = 1; j < len - 1; j++) {  // сдвигаем весь массив на элемент вправо
			tmp2 = m[j];
			m[j] = tmp1;
			tmp1 = tmp2;
		
		}
	}

	cout << endl;

	cout << "{ " << " ";
	for (int i = 0; i < len - 1; i++) {  // вывод массива
		cout << m[i] << " ";
	}
	cout << " }" << " ";
	
	cout << endl;
	return 0;
}
